# pandas
 

Pandas는 쉽고 직관적인 관계형 또는 분류된 데이터로 작업 할 수 있도록 설계된 

빠르고 유연하며 표현이 풍부한 데이터 구조를 제공하는 Python 패키지이다.

## 데이터 다운
kaggle로그인 - Competitions - Titanic 검색 - Data - Download All

메타데이터 :: 데이터를 위한 설명서

데이터사전 :: 변수-정의-키

In [ ]:
pip install pandas

In [1]:
import pandas as pd

In [6]:
import os
os.getcwd()  #현재 경로 찾기

'C:\\Users\\a\\TIL\\08_Data Analytics'

### 데이터 가져오기

In [8]:
# 1. 내 위치를 기준으로 상대 경로로 데이터 가져오기
titan_df = pd.read_csv('./spaceship-titanic/train.csv')

In [11]:
# 2. 절대경로로 데이터 가져오기
titan_df2 = pd.read_csv('C:\\Users\\a\\TIL\\08_Data Analytics\\spaceship-titanic\\train.csv')

In [13]:
print('Data Frame의 형태:', titan_df.shape) # 행 8693 열 14 8693 rows × 14 columns

Data Frame의 형태: (8693, 14)

### 데이터 확인

In [17]:
#info()
titan_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8693 entries, 0 to 8692
Data columns (total 14 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   PassengerId   8693 non-null   object
 1   HomePlanet    8492 non-null   object
 2   CryoSleep     8476 non-null   object
 3   Cabin         8494 non-null   object
 4   Destination   8511 non-null   object
 5   Age           8514 non-null   float64
 6   VIP           8490 non-null   object
 7   RoomService   8512 non-null   float64
 8   FoodCourt     8510 non-null   float64
 9   ShoppingMall  8485 non-null   float64
 10  Spa           8510 non-null   float64
 11  VRDeck        8505 non-null   float64
 12  Name          8493 non-null   object
 13  Transported   8693 non-null   bool
dtypes: bool(1), float64(6), object(7)
memory usage: 891.5+ KB

In [18]:
#describe()
titan_df.describe()

,Age,RoomService,FoodCourt,ShoppingMall,Spa,VRDeck
count,8514.000000,8512.000000,8510.000000,8485.000000,8510.000000,8505.000000
mean,28.827930,224.687617,458.077203,173.729169,311.138778,304.854791
std,14.489021,666.717663,1611.489240,604.696458,1136.705535,1145.717189
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,19.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,27.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,38.000000,47.000000,76.000000,27.000000,59.000000,46.000000
max,79.000000,14327.000000,29813.000000,23492.000000,22408.000000,24133.000000

In [22]:
titan_df.head(3)  # 숫자 안 넣으면 5개 나옴

,PassengerId,HomePlanet,CryoSleep,Cabin,Destination,Age,VIP,RoomService,FoodCourt,ShoppingMall,Spa,VRDeck,Name,Transported
0,0001_01,Europa,False,B/0/P,TRAPPIST-1e,39.0,False,0.0,0.0,0.0,0.0,0.0,Maham Ofracculy,False
1,0002_01,Earth,False,F/0/S,TRAPPIST-1e,24.0,False,109.0,9.0,25.0,549.0,44.0,Juanna Vines,True
2,0003_01,Europa,False,A/0/S,TRAPPIST-1e,58.0,True,43.0,3576.0,0.0,6715.0,49.0,Altark Susent,False

### 단일 요소 추출

In [27]:
# position_based_indexing(위치기반 인덱싱)
# iloc 함수
titan_df.iloc[0,5] # row0, col5

39.0

In [28]:
#Lable_based_indexing(명칭기반 인덱싱)
# loc함수
titan_df.loc[0,'Age'] #row0, col명칭

39.0

### 원하는 컬럼 가져오기

In [39]:
# 1차원
# titan_df['Age']
type(titan_df['Age'])

pandas.core.series.Series

In [42]:
# 2차원
type(titan_df[['Age']])

pandas.core.frame.DataFrame

In [37]:
# 2차원
type(titan_df)

pandas.core.frame.DataFrame

In [46]:
titan_df['PassengerId', 'Age','VIP'] #[]는 1차원인데 3가지 컬럼을 가져오니 오류

In [48]:
titan_df[['PassengerId', 'Age','VIP']].head() # 2차원으로 만들기 위해 [[]]

  PassengerId   Age    VIP
0     0001_01  39.0  False
1     0002_01  24.0  False
2     0003_01  58.0   True
3     0003_02  33.0  False
4     0004_01  16.0  False

#### dataframe은 무조건 2차원이다.

### value_counts() 함수
기본적으로 1차원 지원. 요즘은 2차원 데이터도 지원

In [53]:
#titan_df.VIP
titan_df['VIP'].value_counts()

False    8291
True      199
Name: VIP, dtype: int64

In [63]:
titan_df['VIP'.'Transported'].value_counts()

SyntaxError: invalid syntax (764347162.py, line 1)

### 행과 열 추가 삭제

파생변수 = 연구자의 논리적 주관에 따라 데이터 정보에 맞게 생성된 변수

In [76]:
# 열 추가
titan_df['Age_0'] = 0

# 파생변수 생성
titan_df['fee'] = titan_df.RoomService + titan_df.FoodCourt + titan_df.ShoppingMall + titan_df.Spa
titan_df['total'] = titan_df.RoomService + titan_df.FoodCourt + titan_df.ShoppingMall + titan_df.Spa

titan_df['Age_by_100'] = titan_df.Age * 100

In [79]:
titan_df.head()

,PassengerId,HomePlanet,CryoSleep,Cabin,Destination,Age,VIP,RoomService,FoodCourt,ShoppingMall,Spa,VRDeck,Name,Transported,Age_0,fee,total,Age_by_100
0,0001_01,Europa,False,B/0/P,TRAPPIST-1e,39.0,False,0.0,0.0,0.0,0.0,0.0,Maham Ofracculy,False,0,0.0,0.0,3900.0
1,0002_01,Earth,False,F/0/S,TRAPPIST-1e,24.0,False,109.0,9.0,25.0,549.0,44.0,Juanna Vines,True,0,692.0,692.0,2400.0
2,0003_01,Europa,False,A/0/S,TRAPPIST-1e,58.0,True,43.0,3576.0,0.0,6715.0,49.0,Altark Susent,False,0,10334.0,10334.0,5800.0
3,0003_02,Europa,False,A/0/S,TRAPPIST-1e,33.0,False,0.0,1283.0,371.0,3329.0,193.0,Solam Susent,False,0,4983.0,4983.0,3300.0
4,0004_01,Earth,False,F/1/S,TRAPPIST-1e,16.0,False,303.0,70.0,151.0,565.0,2.0,Willy Santantines,True,0,1089.0,1089.0,1600.0

#### drop() 열삭제
1. 원본에서 컬럼을 지우는 방법 (1.변수에 재할당 2.inplace=True인자 추가)

2. 원본은 그대로 두고 컬럼을 지우는 방법(inplace인자 적지 않거나 False로)

In [86]:
# 열 삭제
titan_df.columns
titan_df.drop('fee', axis=1, inplace=True)
# 인자
# 1.fee만 치면 "['fee'] not found in axis" 오류 뜬다.
# 2.지울 것이 행이라면 0 열이라면 1 인자를 넣어줘야 함.
# 3.inplace옵션. return 값은 없고, 원본이 수정된다.

Index(['PassengerId', 'HomePlanet', 'CryoSleep', 'Cabin', 'Destination', 'Age',
       'VIP', 'RoomService', 'FoodCourt', 'ShoppingMall', 'Spa', 'VRDeck',
       'Name', 'Transported', 'Age_0', 'total', 'Age_by_100'],
      dtype='object')

In [84]:
titan_df.head()

,PassengerId,HomePlanet,CryoSleep,Cabin,Destination,Age,VIP,RoomService,FoodCourt,ShoppingMall,Spa,VRDeck,Name,Transported,Age_0,total,Age_by_100
0,0001_01,Europa,False,B/0/P,TRAPPIST-1e,39.0,False,0.0,0.0,0.0,0.0,0.0,Maham Ofracculy,False,0,0.0,3900.0
1,0002_01,Earth,False,F/0/S,TRAPPIST-1e,24.0,False,109.0,9.0,25.0,549.0,44.0,Juanna Vines,True,0,692.0,2400.0
2,0003_01,Europa,False,A/0/S,TRAPPIST-1e,58.0,True,43.0,3576.0,0.0,6715.0,49.0,Altark Susent,False,0,10334.0,5800.0
3,0003_02,Europa,False,A/0/S,TRAPPIST-1e,33.0,False,0.0,1283.0,371.0,3329.0,193.0,Solam Susent,False,0,4983.0,3300.0
4,0004_01,Earth,False,F/1/S,TRAPPIST-1e,16.0,False,303.0,70.0,151.0,565.0,2.0,Willy Santantines,True,0,1089.0,1600.0

In [89]:
titan_df.drop(['Age_by_100','total'], axis=1).head(5) # 원본은 삭제 안됨

,PassengerId,HomePlanet,CryoSleep,Cabin,Destination,Age,VIP,RoomService,FoodCourt,ShoppingMall,Spa,VRDeck,Name,Transported,Age_0
0,0001_01,Europa,False,B/0/P,TRAPPIST-1e,39.0,False,0.0,0.0,0.0,0.0,0.0,Maham Ofracculy,False,0
1,0002_01,Earth,False,F/0/S,TRAPPIST-1e,24.0,False,109.0,9.0,25.0,549.0,44.0,Juanna Vines,True,0
2,0003_01,Europa,False,A/0/S,TRAPPIST-1e,58.0,True,43.0,3576.0,0.0,6715.0,49.0,Altark Susent,False,0
3,0003_02,Europa,False,A/0/S,TRAPPIST-1e,33.0,False,0.0,1283.0,371.0,3329.0,193.0,Solam Susent,False,0
4,0004_01,Earth,False,F/1/S,TRAPPIST-1e,16.0,False,303.0,70.0,151.0,565.0,2.0,Willy Santantines,True,0

In [90]:
titan_df = titan_df.drop(['Age_by_100','total'], axis=1)